In [9]:
import random
import pandas as pd

In [10]:
data = {
    "Country": [
        "USA", "USA", "UK", "Canada", "India", "USA", "France", "India",
        "UK", "Germany", "Canada", "France", "Australia", "India", "UK",
        "France", "Australia", "Germany", "Canada", "Australia"
    ],
    "Price": [random.randint(500, 1500) for _ in range(20)]
}

In [18]:
df = pd.DataFrame(data)

In [21]:
df.head()

  Country  Price
0     USA   1076
1     USA   1303
2      UK   1101
3  Canada   1086
4   India   1291